app/Http/Controllers/User/FrontendController.php

    public function details(request $request, $slug){
      $this->authorize('mahasiswa');
      if (Auth::check()) {
        $inCarts = Cart::where('users_id', $this->authorize('mahasiswa'))->count();
      }else {
        $inCarts = Cart::count();
---
select count(*) as aggregate from `carts` where `mahasiswa_id` is null

    public function checkout(CheckoutRequest $request){
     $data =  $request->all();

      //Get Carts Data
      $carts = Cart::with('inventory')->get();

      //Add to Transaction data
      $data['name'] = $request->name;
      // $data['total_price'] = $carts->sum('inventory.jumlah');

      //Create transaction item
      $transactions = Transaction::create($data);
---
insert into `transactions` (`name`, `nim`, `kelas`, `phone`, `keperluan`, `matakuliah_id`, `pertemuan_ke`, `laboratorium`, `users_id`, `updated_at`, `created_at`) values ('Aditya Gustian', '3131', '3123', '131', 'PRAKTIKUM', '2', '123', '131', 4, '2022-07-28 00:59:18', '2022-07-28 00:59:18')

    public function return(CheckoutReturnRequest $request){
      // return $request->all();

       //Get Carts Data
       $loans = LoanItem::with('inventory')->where('users_id', Auth::user()->id)->get();
       $transactions = Transaction::with('user')->where('users_id', Auth::user()->id)->get();

       //Add to Transaction data
       $data['nama'] = Auth::user()->name;
       $data['users_id'] = Auth::user()->id;
       // $data['total_price'] = $carts->sum('inventory.jumlah');

       //Create transaction item
       $transactionsreturn = TransactionReturn::create($data);

       //Create transaction item graph
       foreach ($loans as $loan ) {
         $items[] = ReturnItem::create([
           'transactionreturn_id' => $transactionsreturn->id,
           'users_id' => $loan->users_id,
          //  'total' => $loan->total,
           'inventory_id' => $loan->inventories_id
         ]);
       }

       foreach ($transactions as $transaction) {
        $items[] = TransactionReturn::create([
        'transactions_id' => $transaction->id,
        'name' => $transaction->name,
        'nim' => $transaction->nim,
        'kelas' => $transaction->kelas,
        'phone' => $transaction->pertemuan_ke,
        'keperluan' => $transaction->laboratorium,

        ]);
---
insert into `transaction_returns` (`users_id`, `name`, `transactions_id`, `nim`, `kondisi`, `keterangan`, `kelas`, `phone`, `pertemuan_ke`, `keperluan`, `laboratorium`, `updated_at`, `created_at`) values (4, 'Aditya Gustian', 5, '932019028', 'BAGUS', 'dadad', '3TE1', '083138794243', 13, 'PRAKTIKUM', 'GE-313', '2022-07-26 06:39:58', '2022-07-26 06:39:58')
insert into `transaction_returns` (`users_id`, `name`, `transactions_id`, `nim`, `kondisi`, `keterangan`, `kelas`, `phone`, `pertemuan_ke`, `keperluan`, `laboratorium`, `updated_at`, `created_at`) values (4, 'Aditya Gustian', 1, '932019028', 'BAGUS', 'Mengembalikan Barang Peminjamanan', '3TE1', '083138794243', 12, 'PKM', 'GE-313', '2022-07-28 08:14:41', '2022-07-28 08:14:41')


       //Delete cart after transaction
       Cart::where('users_id', Auth::user()->id)->delete();
       Transaction::where('users_id', Auth::user()->id)->delete();
---
delete from `transactions` where `users_id` = 4

    public function pengembalian(request $request){
      $loanItem = LoanItem::with('inventory' , 'transaction')->get();
---
select * from `inventories` where `inventories`.`id` in (1) and `inventories`.`deleted_at` is null
select * from `transactions` where `transactions`.`id` in (7)