app/Http/Controllers/User/FrontendController.php

select * from `loan_items`
select * from `inventories` where `inventories`.`id` in (1, 2, 3) and `inventories`.`deleted_at` is null
select * from `transactions` where `transactions`.`id` in (30, 31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 49, 50, 51, 52, 55, 56)
select count(*) as aggregate from `transactions` where `status` = 'PENDING'
select count(*) as aggregate from `inventories` where `inventories`.`deleted_at` is null
select count(*) as aggregate from `transactions`
select * from `mahasiswas` where `mahasiswas`.`deleted_at` is null order by `created_at` desc limit 7 offset 0
select count(*) as aggregate from `mahasiswas` where `mahasiswas`.`deleted_at` is null
---
    public function home(Request $request){

        if ($request->user()) {
          $loanItem = LoanItem::with(['inventory', 'transaction'])->get();
        }else {
          $loanItem = LoanItem::with(['inventory'])->get();
      }

      return view('pages.frontend.home', [
        'status' => LoanItem::count(),
        'jumlah_alat' => Inventory::count(),
        'user_pinjam' => Transaction::count(),
        'loan_pending' => Transaction::where('status', 'PENDING')->count(),
        'loan_success' => Transaction::where('status', 'SUCCESS')->count(),
        "items" => $loanItem,
        "mhs" =>  Mahasiswa::latest()->filter(request(['search']))->paginate(7)->withQueryString(),
        "title" => "home"
      ]);

select count(*) as aggregate from `carts` where `users_id` = 4
select * from `category_items` where `category_items`.`id` in (1, 2, 3, 4, 5)
select * from `inventories` where `inventories`.`deleted_at` is null
select * from `labs` where `labs`.`id` in (1, 2)
select * from `loan_items` where `loan_items`.`id` in ('')
---
    public function peminjaman(request $request){

      if (Auth::check() == true) {
        $inCarts = Cart::where('users_id', Auth::user()->id)->count();
      }
      else {
        $inCarts = Cart::count();
      }
        $data = Inventory::with('category_items', 'labs', 'loan_items')->get();

select count(*) as aggregate from `carts` where `users_id` = 3
select * from `carts` where `users_id` = 3
select * from `carts` where `users_id` = 4
select * from `inventories` where `inventories`.`id` in (1, 2) and `inventories`.`deleted_at` is null
---
    public function read(Request $request)
    {
      $inCarts = Cart::where('users_id', Auth::user()->id)->count();
      $carts = Cart::with(['inventory'])->where('users_id', Auth::user()->id)->get();

insert into `carts` (`users_id`, `inventories_id`, `updated_at`, `created_at`) values (4, '1', '2022-07-26 06:49:56', '2022-07-26 06:49:56')
---
    public function cartAdd(request $request, $id){
      Cart::create([
        'users_id' => Auth::user()->id,
        'inventories_id' => $id,
      ]);

select * from `carts` where `carts`.`id` = '80' limit 1
delete from `carts` where `id` = 80
---
    public function cartDelete(Request $request, $id){
      $data = Cart::findOrFail($id);
      $data->name = $request->name;

      $data->delete();

select * from `inventories` where `inventories`.`id` in (1, 2) and `inventories`.`deleted_at` is null
insert into `transactions` (`name`, `nim`, `kelas`, `phone`, `keperluan`, `matakuliah_id`, `pertemuan_ke`, `laboratorium`, `users_id`, `updated_at`, `created_at`) values ('Aditya Gustian', '123', '313', '131', 'PENELITIAN', '2', '131', '313', 4, '2022-07-26 07:14:19', '2022-07-26 07:14:19')
insert into `loan_items` (`transactions_id`, `users_id`, `total`, `inventory_id`, `updated_at`, `created_at`) values (9, 4, 1, 1, '2022-07-26 07:14:19', '2022-07-26 07:14:19')
delete from `carts` where `users_id` = 4
select * from `carts` where `users_id` = 4
---
    public function checkout(CheckoutRequest $request){
     $data = $request->all();

      //Get Carts Data
      $carts = Cart::with('inventory')->where('users_id', Auth::user()->id)->get();

      //Add to Transaction data
      $data['nama'] = Auth::user()->name;
      $data['users_id'] = Auth::user()->id;
      // $data['total_price'] = $carts->sum('inventory.jumlah');

      //Create transaction item
      $transactions = Transaction::create($data);

      //Create transaction item
      foreach ($carts as $cart ) {
        $items[] = LoanItem::create([
          'transactions_id' => $transactions->id,
          'users_id' => $cart->users_id,
          'inventory_id' => $cart->inventories_id
        ]);
      }

      //Delete cart after transaction
      Cart::where('users_id', Auth::user()->id)->delete();

select * from `inventories` where `inventories`.`id` in (1, 2) and `inventories`.`deleted_at` is null
select * from `loan_items` where `users_id` = 4
insert into `loan_items` (`transactions_id`, `users_id`, `total`, `inventory_id`, `updated_at`, `created_at`) values (21, 4, 1, 1, '2022-07-28 00:59:18', '2022-07-28 00:59:18')
select * from `users` where `users`.`id` in (4)
---
    public function return(CheckoutReturnRequest $request){
      return $request->all();

       //Get Carts Data
       $carts = LoanItem::with('inventory')->where('users_id', Auth::user()->id)->get();

       //Add to Transaction data
       $data['nama'] = Auth::user()->name;
       $data['users_id'] = Auth::user()->id;
       // $data['total_price'] = $carts->sum('inventory.jumlah');

       //Create transaction item
       $transactionsreturn = TransactionReturn::create($data);

       //Create transaction item graph
       foreach ($carts as $cart ) {
         $items[] = LoanItem::create([
           'transactions_id' => $transactionsreturn->id,
           'users_id' => $cart->users_id,
           'inventory_id' => $cart->inventories_id
         ]);
       }

       //Delete cart after transaction
       Cart::where('users_id', Auth::user()->id)->delete();

select * from `inventories` where `inventories`.`id` in (1, 2, 3, 4) and `inventories`.`deleted_at` is null
select * from `users` where `users`.`id` in (4)
---
    public function details(request $request, $slug){

      $item = Inventory::with(['galleries'])->where('slug', $slug)->firstOrFail();
      $inCarts = Cart::where('users_id', Auth::user()->id)->count();

select * from `loan_items` where `users_id` = 4
select * from `transactions` where `users_id` = 4 limit 1
---
    public function pengembalian(request $request){
      $loanItem = LoanItem::with('inventory' , 'transaction')->where('users_id', Auth::user()->id)->get();