app/Http/Controllers/EmailController.php

    public function notif(){
      $user1 = User::with('roles')->where('roles_id', 1)->get();
      $user = User::with('roles')->where('roles_id', 2)->get();
---
select * from `roles` where `roles`.`id` in (1)
select * from `users` where `roles_id` = 1
select * from `roles` where `roles`.`id` in (2)
select * from `users` where `roles_id` = 2