app/Http/Controllers/InventoryController.php

select * from `category_items` where `category_items`.`id` in (1, 2, 3, 4, 5)
select * from `inventories` where `inventories`.`deleted_at` is null
select * from `labs` where `labs`.`id` in (1, 2)
---
    public function index()
    {

        // "posts" =>  Post::all()

        $items = Inventory::with(['category_items', 'labs'])->get();