app/Http/Controllers/TransactionController.php

    public function index(Transaction $transaction)
    {
        $transaction = Transaction::with(['user'])->get();
---
select * from `transactions`

    public function update(TransactionRequest $request, Transaction $transaction)
    {
      $data= $request->all();
      $transaction->update($data);
---
update `transactions` set `status` = 'SUCCESS', `transactions`.`updated_at` = '2022-07-25 22:30:50' where `id` = 7