app/Http/Controllers/admin/homecontroller.php

      public function home(Request $request){


        $transaction = Transaction::with(['studies', 'user'])->get();
        $transactionreturn = TransactionReturn::with(['user'])->get();


      return view('pages.admin.home', [
        'status' => LoanItem::count(),
        'jumlah_alat' => Inventory::count(),
        'user_pinjam' => Transaction::count(),
        'loan_pending' => Transaction::where('status', 'PENDING')->count(),
        'loan_success' => Transaction::where('status', 'SUCCESS')->count(),
        "items" => $transaction,
        "pengembalian" => $transactionreturn,
        "mhs" =>  Mahasiswa::latest()->filter(request(['search']))->paginate(7)->withQueryString(),
---
select * from `transactions`
select * from `transaction_returns`
select * from `users` where `users`.`id` in (4)
select count(*) as aggregate from `inventories` where `inventories`.`deleted_at` is null
select count(*) as aggregate from `transactions`
select count(*) as aggregate from `transactions` where `status` = 'PENDING'
select count(*) as aggregate from `transactions` where `status` = 'SUCCESS'
select * from `mahasiswas` where `mahasiswas`.`deleted_at` is null order by `created_at` desc limit 7 offset 0
select count(*) as aggregate from `mahasiswas` where `mahasiswas`.`deleted_at` is null